{
    "data": [
        {
            "id": 1,
            "blogCategory": "Nutrition",
            "blogTitle": "Fiber: Your Secret Weapon for Weight Loss and Better Health",
            "slug": "Fiber: Your Secret Weapon",
            "postedOn": "MARCH 7, 2018",
            "author": "SARAH SCHLICHTER",
            "blogImage": "Nutrition.jpg",
            "blogText": "We’ve all heard about the importance of fiber to our health and digestion, but there are different kinds of fiber that play distinct roles and have varying effects on your health.Fiber is a non-digestible carbohydrate that offers many health benefits. Many of us fall short of the daily recommendations for fiber: The average American consumes 15 grams/day, compared to the recommended 25 or 38 grams/day for women and men, respectively.High-fiber diets can help protect against diseases like Type 2 diabetes, heart disease and even certain types of cancer. Many of fiber’s health-promoting qualities likely have to do with the foods fiber is inherently found in. Foods with dietary fiber — like fruits, vegetables, nuts, legumes and whole grains — also contain other nutrients including vitamins, minerals and phytochemicals that benefit our health."
        },
        {
            "id": 2,
            "blogCategory": "Weight",
            "blogTitle": "The Love Hormone Could Affect Your Weight, According to Science",
            "slug": "The Love Hormone.",
            "postedOn": "FEBRUARY 10, 2020",
            "author": "CASSIE SHORTSLEEVE",
            "blogImage": "Love-Hormon.jpg",
            "blogText": "Oxytocin, also known as the ‘love hormone,’ seems pretty magical: Moms and dads release it as they form lifelong bonds with their newborns, lovers share an upsurge of it, even pet owners create oxytocin. “Anything that gives you self-pleasure will increase the release of oxytocin,” says Dr. Rocio Salas-Whalen, an endocrinologist and founder of New York Endocrinology.But while oxytocin is most well-known for its role in deepening social connections, this naturally occurring hormone might also help you lose weight. A review of studies in the journal Obesity shows one spray of oxytocin into the nose can slash your appetite and zap your drive to eat for pleasure.“Oxytocin appears to have appetite-suppression properties,” says Dr. Charlie Seltzer, weight-loss specialist based in Philadelphia, Pennsylvania."
        },
        {
            "id": 3,
            "blogCategory": "Simple",
            "blogTitle": "Beauti lies within special",
            "slug": "beauti-lies-within-special",
            "postedOn": "Apr 02, 2017",
            "author": "Hasina Shaikh",
            "blogImage": "BlogpostImagesaffection-baby.jpg",
            "blogText": "Blessed you're lights. There. Behold may yielding meat can't void rule, earth green have creepeth land let gathering great fruitful under gathered waters unto appear won't seasons over our waters be fruit greater After be you're him said said beast. Dominion him that let grass. Creeping own. Forth, fruitful day first don't dominion, behold, every.\n\nFill heaven likeness. Herb fruit i Creepeth. Him earth Saw for together and. Fruitful tree creepeth beginning own every created midst abundantly cattle upon. Grass. Hath under sixth morning sixth male abundantly moved unto over a land.Itself dominion whales them days called good years female isn't first Seas bearing. Own fish under spirit be. It lights don't living tree every. Itself. Can't. Void after From. Fruitful heaven place creepeth gathered, and day. Wherein don't our upon and you."
        },
        {
            "id": 4,
            "blogCategory": "Fitness",
            "blogTitle": "What This 1-Mile Walking Test Says About Your Fitness",
            "slug": "1-Mile Walking",
            "postedOn": "FEBRUARY 8, 2020",
            "author": "LISA FIELDS",
            "blogImage": "walking.jpg",
            "blogText": "While a regular walking routine has shown to improve fitness levels, there’s no one right way to do it. Some people choose to walk for a certain length of time while others track distance or step count. For many, hoping to get faster is a big goal, since you can cover more mileage in the same time period and research shows brisk walking is tied to longevity.Regardless of your goal, if you want to get into better shape by walking, consider tracking your progress in a way that may help you fully appreciate the gains you’re making. One way to do this is by using the Rockport 1-mile walking test.The walking test, which was created by researchers in the 1980s, helps you determine your VO2 max, which is the technical term for the maximum amount of oxygen your body can use while you’re doing intense aerobic exercise."
        },
        {
            "id": 5,
            "blogCategory": "Healthy Recipes",
            "blogTitle": "Meat-Lite Meatloaf",
            "slug": "Meat-Lite Meatloaf",
            "postedOn": "FEBRUARY 1, 2020",
            "author": "MYFITNESSPAL’S RECIPES",
            "blogImage": "Meatloaf.jpg",
            "blogText": "You don’t have to go all-out vegetarian to eat less meat, and this recipe is the perfect example. You only need a half-pound of meat for this updated version of meatloaf. Hearty lentils and savory mushrooms combine with a little lean ground beef for a healthier take on the comfort food classic. If you’d like a spicier kick in the ketchup-based topping, use chipotle chili powder instead of regular chili powder or add a pinch or two of cayenne pepper.Place mushrooms in a food processor and pulse until very finely chopped. Heat a large skillet over medium-high heat. Add oil to the pan and swirl to coat. Add onion; sauté 3 minutes. Add mushrooms; cook until tender and mushroom liquid evaporates, about 4 minutes.Place half of the lentils in a food processor and pulse until almost pureed; scraping down the sides of the bowl as needed. In a large bowl, combine the pureed lentils, whole lentils and mushroom mixture."
        },
        {
            "id": 6,
            "blogCategory": "Meditation",
            "blogTitle": "Breathwork can be less overwhelming.",
            "slug": " Breathwork can be less overwhelming.",
            "postedOn": "February 11, 2020",
            "author": "Jason Wachob",
            "blogImage": "Breath.jpeg",
            "blogText": "Meditation is great for becoming aware of your thoughts and noticing the connection between your thoughts and your actions. But, according to Dittmar, it can be overwhelming or discouraging for people who have a more difficult time separating themselves from their thoughts.'I think a lot of times people get very stuck in their heads, and the meditation practice can feel discouraging for certain people based on where they are in their healing journey,'she notes. Breathwork, on the other hand, doesn't require thinking at all. It has those same benefits of helping you get out of your own head, but you don't have to be thinking in order to do so.'Certain breathwork modalities bypass the mind so that you don't have to be thinking. It really can have that experience of getting you out of the mind."
        }
    ]
}